Extensions/АБ/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Контрагенты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_Клиент</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Конкурент</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Перевозчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Подрядчик</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Поставщик</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПрочиеОтношения</Name>
					<Comment>Задача 326149</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_Хранитель_Арендодатель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/InformationRegisters/УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаБлокировкиРазблокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_СтатусыБлокировкиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/АБ/Enums/УВМ_СтатусыБлокировкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_СтатусыБлокировкиКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Catalogs/Контрагенты/Forms/УВМ_ФормаЗапретаОтгрузки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ РомановНЕ 20240115 (161623)
	// свойства по умолчанию
	Элементы.ГруппаИзменений.Видимость = Ложь;
	ДоступКБлокировкеКонтрагентов = Истина;
	Контрагент = Параметры.Контрагент;
	
	ОпределитьДоступностьПользователя();
	Элементы.ГруппаЗапретРазрешениеОтгрузки.Доступность = ДоступКБлокировкеКонтрагентов;

	НаименованеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "Наименование");
	ДополнительнаяИнформация = ПолучитьДополнительнуюИнформацию(Контрагент);
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДополнительнаяИнформация);
	
	Если ОтгрузкаРазрешенаЗапрещена = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Заблокирован Тогда
		Элементы.ГруппаСтраницыЗапрета.ТекущаяСтраница = Элементы.ГруппаОтгрузкаЗапрещена;
	Иначе
		Элементы.ГруппаСтраницыЗапрета.ТекущаяСтраница = Элементы.ГруппаОтгрузкаРазрешена;
	КонецЕсли;

	Элементы.ДекорацияНадписьРазрешена.Заголовок = СтрЗаменить(Элементы.ДекорацияНадписьРазрешена.Заголовок, "%1%", НаименованеКонтрагента);
	Элементы.ДекорацияНадписьЗапрещена.Заголовок = СтрЗаменить(Элементы.ДекорацияНадписьЗапрещена.Заголовок, "%1%", НаименованеКонтрагента);
	//-- РомановНЕ 20240115 (161623)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтгрузкаРазрешенаЗапрещенаПриИзменении(Элемент)
	
	//++ РомановНЕ 20240115 (161623)
	Модифицированность = НЕ Модифицированность;
	Элементы.ГруппаИзменений.Видимость = Модифицированность;
	//-- РомановНЕ 20240115 (161623)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДополнительнуюИнформацию(Контрагент)
	
	//++ РомановНЕ 20240115 (161623)
	ДополнительнаяИнформация = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Период КАК Период,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.ПричинаБлокировкиРазблокировки КАК ПричинаБлокировкиРазблокировки,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Автор КАК Автор,
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		ДополнительнаяИнформация.Вставить("ОтгрузкаРазрешенаЗапрещена", Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Разблокирован);
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДополнительнаяИнформация.Вставить("Дата", Выборка.Период);
		ДополнительнаяИнформация.Вставить("Причина", Выборка.ПричинаБлокировкиРазблокировки);
		ДополнительнаяИнформация.Вставить("Автор", Выборка.Автор);
		ДополнительнаяИнформация.Вставить("ОтгрузкаРазрешенаЗапрещена", Выборка.Статус);
		
	КонецЕсли;
	
	Возврат ДополнительнаяИнформация;
	//-- РомановНЕ 20240115 (161623)
	
КонецФункции

&НаСервере
Процедура ОпределитьДоступностьПользователя()
	
	ДоступКБлокировкеКонтрагентов = Ложь;
	
КонецПроцедуры

#КонецОбласти
